In [5]:
import pandas as pd
from sqlalchemy import *

db_path = 'postgresql://eqpytyddkgzpje:589827916509690e9baa1abd869d99bd85ac3c9902c361d04c1e560c2befd624@ec2-52-54-38-229.compute-1.amazonaws.com:5432/dap64di8scvd9n'

eng = create_engine(db_path)

In [11]:
pd.read_sql('''select * from "Annotation" where survey_id = '82527c9e-866f-4e7c-b4e6-3d61be2c71a8' order by id desc''',eng).head(30)

,id,survey_id,recording_id,source_count,user_note,practice_round,vertical
0,102,82527c9e-866f-4e7c-b4e6-3d61be2c71a8,54,4,anni\ntrain left back < 270\nflute front\ndril...,False,True
1,101,82527c9e-866f-4e7c-b4e6-3d61be2c71a8,196,3,anni\nperson right\nhammer front right\ncar left,True,None
2,100,82527c9e-866f-4e7c-b4e6-3d61be2c71a8,193,3,anni\nrooster left back\ncrowd back\nairplane ...,True,None

In [13]:
pd.read_sql('''select * from "Confirmation" order by id desc''',eng).head(10)

    id  recording_id  source_id  location_id annotation_id practice_round
0  260            54        110          NaN           102          False
1  259            54         68        342.0           102          False
2  258            54         64        341.0           102          False
3  257            54         59        340.0           102          False
4  256            54         42        339.0           102          False
5  255           196         82        338.0           101           True
6  254           196         56        337.0           101           True
7  253           196         50        336.0           101           True
8  252           193        125        335.0           100           True
9  251           193         98        334.0           100           True

In [14]:
pd.read_sql('''select * from "Interaction" order by id desc''',eng).head(10)

,id,annotation_id,action_type,value,timestamp,practice_round
0,1394,102,submit,None,2022-02-07 07:20:05.750,False
1,1393,102,elevation,3,2022-02-07 07:20:04.686,False
2,1392,102,azimuth,120,2022-02-07 07:20:03.519,False
3,1391,102,elevation,2,2022-02-07 07:19:58.805,False
4,1390,102,azimuth,30,2022-02-07 07:19:56.885,False
5,1389,102,elevation,2,2022-02-07 07:19:54.483,False
6,1388,102,azimuth,359,2022-02-07 07:19:53.068,False
7,1387,102,elevation,1,2022-02-07 07:19:50.205,False
8,1386,102,azimuth,243,2022-02-07 07:19:48.990,False
9,1385,102,source count,4,2022-02-07 07:19:45.972,False

In [16]:
pd.read_sql('''select * from "Location" order by id desc''',eng).head(10)

    id annotation_id  azimuth  elevation  practice_round  color
0  342           102      120          3           False    4.0
1  341           102       30          2           False    3.0
2  340           102      359          2           False    2.0
3  339           102      243          1           False    1.0
4  338           101      273          1            True    3.0
5  337           101       57          0            True    2.0
6  336           101       88          1            True    1.0
7  335           100       90         -1            True    3.0
8  334           100      181         -1            True    2.0
9  333           100      272          2            True    1.0

In [17]:
pd.read_sql('''select * from "Recording" where id = 54''',eng)

   id              recording_name  num_annotation  num_source  vertical
0  54  sources_5_recording_77.wav               1           5      True

In [3]:
pd.read_sql('''select * from "Recording" order by num_annotation desc;''',eng)

      id               recording_name  num_annotation  num_source vertical
0      1   sources_1_recording_29.wav               0           1     True
1      2   sources_1_recording_45.wav               0           1     True
2      3   sources_1_recording_58.wav               0           1     True
3      4  sources_1_recording_107.wav               0           1     True
4      5  sources_1_recording_111.wav               0           1     True
..   ...                          ...             ...         ...      ...
192  193    sources_3_recording_8.wav               0           3     None
193  194  sources_3_recording_130.wav               0           3     None
194  195  sources_3_recording_160.wav               0           3     None
195  196   sources_3_recording_57.wav               0           3     None
196  197  sources_3_recording_150.wav               0           3     None

[197 rows x 5 columns]